In [15]:
import pandas as pd
import numpy as np

In [7]:
df1=pd.DataFrame(np.random.rand(3,5),index='A B C'.split(),columns='M1 M2 M3 M4 M5'.split())
df1

         M1        M2        M3        M4        M5
A  0.446881  0.900877  0.166072  0.313711  0.111186
B  0.790342  0.191115  0.042798  0.620288  0.774022
C  0.899846  0.025815  0.181490  0.284920  0.139118

In [8]:
df1['M1']

A    0.446881
B    0.790342
C    0.899846
Name: M1, dtype: float64

In [10]:
df1[['M2','M3']]

         M2        M3
A  0.900877  0.166072
B  0.191115  0.042798
C  0.025815  0.181490

In [12]:
df1['M6']=df1['M1']+df1['M4']
df1

         M1        M2        M3        M4        M5        M6
A  0.446881  0.900877  0.166072  0.313711  0.111186  0.760591
B  0.790342  0.191115  0.042798  0.620288  0.774022  1.410630
C  0.899846  0.025815  0.181490  0.284920  0.139118  1.184766

In [13]:
df1.drop('M2',axis=1)

         M1        M3        M4        M5        M6
A  0.446881  0.166072  0.313711  0.111186  0.760591
B  0.790342  0.042798  0.620288  0.774022  1.410630
C  0.899846  0.181490  0.284920  0.139118  1.184766

In [14]:
df1.drop(['M1','M4'],axis=1)

         M2        M3        M5        M6
A  0.900877  0.166072  0.111186  0.760591
B  0.191115  0.042798  0.774022  1.410630
C  0.025815  0.181490  0.139118  1.184766

In [16]:
df1.drop('B')

         M1        M2        M3        M4        M5        M6
A  0.446881  0.900877  0.166072  0.313711  0.111186  0.760591
C  0.899846  0.025815  0.181490  0.284920  0.139118  1.184766

In [20]:
df2={'ID':[47,87,45,69,12,44,11,56,88,92],'Name':['Diluc','Ganyu','Klee','Jean','Mona','Keqing','Aether','Ei','Childe','Albedo'],'Rank':[1,2,3,4,5,6,7,8,9,10]}

In [21]:
df2

{'ID': [47, 87, 45, 69, 12, 44, 11, 56, 88, 92],
 'Name': ['Diluc',
  'Ganyu',
  'Klee',
  'Jean',
  'Mona',
  'Keqing',
  'Aether',
  'Ei',
  'Childe',
  'Albedo'],
 'Rank': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]}

In [23]:
df=pd.DataFrame(df2)
df

   ID    Name  Rank
0  47   Diluc     1
1  87   Ganyu     2
2  45    Klee     3
3  69    Jean     4
4  12    Mona     5
5  44  Keqing     6
6  11  Aether     7
7  56      Ei     8
8  88  Childe     9
9  92  Albedo    10

In [24]:
df.drop('ID',axis=1)

     Name  Rank
0   Diluc     1
1   Ganyu     2
2    Klee     3
3    Jean     4
4    Mona     5
5  Keqing     6
6  Aether     7
7      Ei     8
8  Childe     9
9  Albedo    10

In [25]:
df['Name']

0     Diluc
1     Ganyu
2      Klee
3      Jean
4      Mona
5    Keqing
6    Aether
7        Ei
8    Childe
9    Albedo
Name: Name, dtype: object